TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memmap.h
//###########################################################################
//
// FILE:    hw_memmap.h
//
// TITLE:   Macros defining the memory map of the C28x.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_MEMMAP_H
#define HW_MEMMAP_H

//*****************************************************************************
//
// The following are defines for the base address of the memories and
// peripherals.
//
//*****************************************************************************
#define CPU1_ROM_BASE                        0x00000000U
#define CPU2_ROM_BASE                        0x00000000U
#define CPU3_ROM_BASE                        0x00000000U
#define LDA7_RAM_BASE                        0x200E0000U
#define LDA6_RAM_BASE                        0x200E4000U
#define LDA5_RAM_BASE                        0x200E8000U
#define LDA4_RAM_BASE                        0x200EC000U
#define LDA3_RAM_BASE                        0x200F0000U
#define LDA2_RAM_BASE                        0x200F4000U
#define LDA1_RAM_BASE                        0x200F8000U
#define LDA0_RAM_BASE                        0x200FC000U
#define LPA0_RAM_BASE                        0x20100000U
#define LPA1_RAM_BASE                        0x20108000U
#define CPA0_RAM_BASE                        0x20110000U
#define CPA1_RAM_BASE                        0x20118000U
#define CDA0_RAM_BASE                        0x20120000U
#define CDA1_RAM_BASE                        0x20124000U
#define CDA2_RAM_BASE                        0x20128000U
#define CDA3_RAM_BASE                        0x2012C000U
#define CDA4_RAM_BASE                        0x20130000U
#define CDA5_RAM_BASE                        0x20134000U
#define CDA6_RAM_BASE                        0x20138000U
#define CDA7_RAM_BASE                        0x2013C000U
#define CDA8_RAM_BASE                        0x20140000U
#define CDA9_RAM_BASE                        0x20144000U
#define CDA10_RAM_BASE                       0x20148000U
#define CDA11_RAM_BASE                       0x2014C000U
#define C29CPURTINTSTACK_BASE                0x30008000U
#define C29CPUSECCALLSTACK_BASE              0x3000C000U
#define C29CPUSECURE_BASE                    0x3000D000U
#define C29CPUDIAG_BASE                      0x3000E000U
#define C29CPUSELFTEST_BASE                  0x3000F000U
#define CPUDLT_BASE                          0x30010000U
#define C29DEBUGSS_BASE                      0x30018000U
#define PIPE_BASE                            0x30020000U
#define ERAD_BASE                            0x30030000U
#define LCM_CPU_BASE                         0x30032000U
#define SSUGEN_BASE                          0x30080000U
#define SSUCPU1CFG_BASE                      0x30081000U
#define SSUCPU2CFG_BASE                      0x30082000U
#define SSUCPU3CFG_BASE                      0x30083000U
#define SSUCPU1AP_BASE                       0x30087000U
#define SSUCPU2AP_BASE                       0x30088000U
#define SSUCPU3AP_BASE                       0x30089000U
#define FLASHCONTROLLER1_BASE                0x30100000U
#define FLASHCONTROLLER2_BASE                0x30110000U
#define HSMERRORAGGREGATOR_BASE              0x30120000U
#define DEVCFG_BASE                          0x30180000U
#define ANALOGSUBSYS_BASE                    0x30182000U
#define GPIOCTRL_BASE                        0x30190000U
#define IPCCOUNTER_BASE                      0x301B0000U
#define RTDMA1_BASE                          0x301C0000U
#define RTDMA1_DIAG_BASE                     0x301C0800U
#define RTDMA1_SELFTEST_BASE                 0x301C0C00U
#define RTDMA1_MPU_BASE                      0x301C1000U
#define RTDMA2_BASE                          0x301C8000U
#define RTDMA2_DIAG_BASE                     0x301C8800U
#define RTDMA2_SELFTEST_BASE                 0x301C8C00U
#define RTDMA2_MPU_BASE                      0x301C9000U
#define FRI1_BASE                            0x301D0000U
#define MEMSSLCFG_BASE                       0x301D8000U
#define MEMSSCCFG_BASE                       0x301D8400U
#define MEMSSMCFG_BASE                       0x301D8800U
#define MEMSSMISCI_BASE                      0x301D8E00U
#define SYNCBRIDGEMPU_BASE                   0x301E0000U
#define INPUTXBAR_BASE                       0x301E8000U
#define EPWMXBAR_BASE                        0x301E9000U
#define CLBXBAR_BASE                         0x301EA000U
#define OUTPUTXBAR_BASE                      0x301EB000U
#define MDLXBAR_BASE                         0x301EC000U
#define ICLXBAR_BASE                         0x301ED000U
#define LCM_DMA_BASE                         0x301F4000U
#define CPUSYS_BASE                          0x30200000U
#define CPUPERCFG_BASE                       0x30208000U
#define WD_BASE                              0x30208C00U
#define CPUTIMER0_BASE                       0x30218000U
#define CPUTIMER1_BASE                       0x30219000U
#define CPUTIMER2_BASE                       0x3021A000U
#define CPU1IPCSEND_BASE                     0x30220000U
#define CPU2IPCSEND_BASE                     0x30228000U
#define CPU3IPCSEND_BASE                     0x30230000U
#define CPU1IPCRCV_BASE                      0x30240000U
#define CPU2IPCRCV_BASE                      0x30248000U
#define CPU3IPCRCV_BASE                      0x30250000U
#define GPIODATA_BASE                        0x30268000U
#define GPIODATAREAD_BASE                    0x30269000U
#define XINT_BASE                            0x30270000U
#define DTHE_BASE                            0x30280000U
#define CRCS_BASE                            0x30281000U
#define CRCP_BASE                            0x30282000U
#define SHAS_BASE                            0x30284000U
#define SHAP_BASE                            0x30285000U
#define AESS_BASE                            0x30286000U
#define AESP_BASE                            0x30287000U
#define SM4_BASE                             0x30288000U
#define SM3_BASE                             0x30289000U
#define TRNG_BASE                            0x3028A000U
#define PKE_BASE                             0x30290000U
#define ESC_SS_BASE                          0x30388000U
#define ESC_SS_CONFIG_BASE                   0x30388200U
#define ADCARESULT_BASE                      0x303C0000U
#define ADCBRESULT_BASE                      0x303C1000U
#define ADCCRESULT_BASE                      0x303C2000U
#define ADCDRESULT_BASE                      0x303C3000U
#define ADCERESULT_BASE                      0x303C4000U
#define EMIF1_BASE                           0x30800000U

