TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memmap.h
#define RTDMA1CH1_BASE_FRAME(i)              (0x60000000U + ((i) * 0x400000U))
#define RTDMA1CH2_BASE_FRAME(i)              (0x60001000U + ((i) * 0x400000U))
#define RTDMA1CH3_BASE_FRAME(i)              (0x60002000U + ((i) * 0x400000U))
#define RTDMA1CH4_BASE_FRAME(i)              (0x60003000U + ((i) * 0x400000U))
#define RTDMA1CH5_BASE_FRAME(i)              (0x60004000U + ((i) * 0x400000U))
#define RTDMA1CH6_BASE_FRAME(i)              (0x60005000U + ((i) * 0x400000U))
#define RTDMA1CH7_BASE_FRAME(i)              (0x60006000U + ((i) * 0x400000U))
#define RTDMA1CH8_BASE_FRAME(i)              (0x60007000U + ((i) * 0x400000U))
#define RTDMA1CH9_BASE_FRAME(i)              (0x60008000U + ((i) * 0x400000U))
#define RTDMA1CH10_BASE_FRAME(i)             (0x60009000U + ((i) * 0x400000U))
#define RTDMA2CH1_BASE_FRAME(i)              (0x60010000U + ((i) * 0x400000U))
#define RTDMA2CH2_BASE_FRAME(i)              (0x60011000U + ((i) * 0x400000U))
#define RTDMA2CH3_BASE_FRAME(i)              (0x60012000U + ((i) * 0x400000U))
#define RTDMA2CH4_BASE_FRAME(i)              (0x60013000U + ((i) * 0x400000U))
#define RTDMA2CH5_BASE_FRAME(i)              (0x60014000U + ((i) * 0x400000U))
#define RTDMA2CH6_BASE_FRAME(i)              (0x60015000U + ((i) * 0x400000U))
#define RTDMA2CH7_BASE_FRAME(i)              (0x60016000U + ((i) * 0x400000U))
#define RTDMA2CH8_BASE_FRAME(i)              (0x60017000U + ((i) * 0x400000U))
#define RTDMA2CH9_BASE_FRAME(i)              (0x60018000U + ((i) * 0x400000U))
#define RTDMA2CH10_BASE_FRAME(i)             (0x60019000U + ((i) * 0x400000U))
#define MCANA_DRIVER_BASE_FRAME(i)           (0x60020000U + ((i) * 0x400000U))
#define MCANASS_BASE_FRAME(i)                (0x60024000U + ((i) * 0x400000U))
#define MCANA_BASE_FRAME(i)                  (0x60024600U + ((i) * 0x400000U))
#define MCANA_ERROR_BASE_FRAME(i)            (0x60024800U + ((i) * 0x400000U))
#define MCANB_DRIVER_BASE_FRAME(i)           (0x60028000U + ((i) * 0x400000U))
#define MCANBSS_BASE_FRAME(i)                (0x6002C000U + ((i) * 0x400000U))
#define MCANB_BASE_FRAME(i)                  (0x6002C600U + ((i) * 0x400000U))
#define MCANB_ERROR_BASE_FRAME(i)            (0x6002C800U + ((i) * 0x400000U))
#define MCANC_DRIVER_BASE_FRAME(i)           (0x60030000U + ((i) * 0x400000U))
#define MCANCSS_BASE_FRAME(i)                (0x60034000U + ((i) * 0x400000U))
#define MCANC_BASE_FRAME(i)                  (0x60034600U + ((i) * 0x400000U))
#define MCANC_ERROR_BASE_FRAME(i)            (0x60034800U + ((i) * 0x400000U))
#define MCAND_DRIVER_BASE_FRAME(i)           (0x60038000U + ((i) * 0x400000U))
#define MCANDSS_BASE_FRAME(i)                (0x6003C000U + ((i) * 0x400000U))
#define MCAND_BASE_FRAME(i)                  (0x6003C600U + ((i) * 0x400000U))
#define MCAND_ERROR_BASE_FRAME(i)            (0x6003C800U + ((i) * 0x400000U))
#define MCANE_DRIVER_BASE_FRAME(i)           (0x60040000U + ((i) * 0x400000U))
#define MCANESS_BASE_FRAME(i)                (0x60044000U + ((i) * 0x400000U))
#define MCANE_BASE_FRAME(i)                  (0x60044600U + ((i) * 0x400000U))
#define MCANE_ERROR_BASE_FRAME(i)            (0x60044800U + ((i) * 0x400000U))
#define MCANF_DRIVER_BASE_FRAME(i)           (0x60048000U + ((i) * 0x400000U))
#define MCANFSS_BASE_FRAME(i)                (0x6004C000U + ((i) * 0x400000U))
#define MCANF_BASE_FRAME(i)                  (0x6004C600U + ((i) * 0x400000U))
#define MCANF_ERROR_BASE_FRAME(i)            (0x6004C800U + ((i) * 0x400000U))
#define LINA_BASE_FRAME(i)                   (0x60060000U + ((i) * 0x400000U))
#define LINB_BASE_FRAME(i)                   (0x60061000U + ((i) * 0x400000U))
#define SENT1_BASE_FRAME(i)                  (0x60068000U + ((i) * 0x400000U))
#define SENT2_BASE_FRAME(i)                  (0x60069000U + ((i) * 0x400000U))
#define SENT3_BASE_FRAME(i)                  (0x6006A000U + ((i) * 0x400000U))
#define SENT4_BASE_FRAME(i)                  (0x6006B000U + ((i) * 0x400000U))
#define SENT5_BASE_FRAME(i)                  (0x6006C000U + ((i) * 0x400000U))
#define SENT6_BASE_FRAME(i)                  (0x6006D000U + ((i) * 0x400000U))
#define UARTA_WRITE_BASE_FRAME(i)            (0x60070000U + ((i) * 0x400000U))
#define UARTA_BASE_FRAME(i)                  (0x60070000U + ((i) * 0x400000U))
#define UARTB_WRITE_BASE_FRAME(i)            (0x60072000U + ((i) * 0x400000U))
#define UARTB_BASE_FRAME(i)                  (0x60072000U + ((i) * 0x400000U))
#define UARTC_WRITE_BASE_FRAME(i)            (0x60074000U + ((i) * 0x400000U))
#define UARTC_BASE_FRAME(i)                  (0x60074000U + ((i) * 0x400000U))
#define UARTD_WRITE_BASE_FRAME(i)            (0x60076000U + ((i) * 0x400000U))
#define UARTD_BASE_FRAME(i)                  (0x60076000U + ((i) * 0x400000U))
#define UARTE_WRITE_BASE_FRAME(i)            (0x60078000U + ((i) * 0x400000U))
#define UARTE_BASE_FRAME(i)                  (0x60078000U + ((i) * 0x400000U))
#define UARTF_WRITE_BASE_FRAME(i)            (0x6007A000U + ((i) * 0x400000U))
#define UARTF_BASE_FRAME(i)                  (0x6007A000U + ((i) * 0x400000U))
#define DCC1_BASE_FRAME(i)                   (0x60080000U + ((i) * 0x400000U))
#define DCC2_BASE_FRAME(i)                   (0x60081000U + ((i) * 0x400000U))
#define DCC3_BASE_FRAME(i)                   (0x60082000U + ((i) * 0x400000U))
#define ERRORAGGREGATOR_BASE_FRAME(i)        (0x6008C000U + ((i) * 0x400000U))
#define ESMCPU1_BASE_FRAME(i)                (0x60090000U + ((i) * 0x400000U))
#define ESMCPU2_BASE_FRAME(i)                (0x60091000U + ((i) * 0x400000U))
#define ESMCPU3_BASE_FRAME(i)                (0x60092000U + ((i) * 0x400000U))
#define ESMSYSTEM_BASE_FRAME(i)              (0x6009F000U + ((i) * 0x400000U))
#define ESMSAFETYAGG_BASE_FRAME(i)           (0x600A0000U + ((i) * 0x400000U))
#define WADI1BLK1CONFIG_BASE_FRAME(i)        (0x600B0000U + ((i) * 0x400000U))
#define WADI1BLK2CONFIG_BASE_FRAME(i)        (0x600B0100U + ((i) * 0x400000U))
#define WADI1BLK3CONFIG_BASE_FRAME(i)        (0x600B0200U + ((i) * 0x400000U))
#define WADI1BLK4CONFIG_BASE_FRAME(i)        (0x600B0300U + ((i) * 0x400000U))
#define WADI1OPERSSS_BASE_FRAME(i)           (0x600B1000U + ((i) * 0x400000U))
#define WADI2BLK1CONFIG_BASE_FRAME(i)        (0x600B2000U + ((i) * 0x400000U))
#define WADI2BLK2CONFIG_BASE_FRAME(i)        (0x600B2100U + ((i) * 0x400000U))
#define WADI2BLK3CONFIG_BASE_FRAME(i)        (0x600B2200U + ((i) * 0x400000U))
#define WADI2BLK4CONFIG_BASE_FRAME(i)        (0x600B2300U + ((i) * 0x400000U))
#define WADI2OPERSSS_BASE_FRAME(i)           (0x600B3000U + ((i) * 0x400000U))
#define OUTPUTXBAR1_FLAGS_BASE_FRAME(i)      (0x600C0000U + ((i) * 0x400000U))
#define OUTPUTXBAR2_FLAGS_BASE_FRAME(i)      (0x600C1000U + ((i) * 0x400000U))
#define OUTPUTXBAR3_FLAGS_BASE_FRAME(i)      (0x600C2000U + ((i) * 0x400000U))
#define OUTPUTXBAR4_FLAGS_BASE_FRAME(i)      (0x600C3000U + ((i) * 0x400000U))
#define OUTPUTXBAR5_FLAGS_BASE_FRAME(i)      (0x600C4000U + ((i) * 0x400000U))
#define OUTPUTXBAR6_FLAGS_BASE_FRAME(i)      (0x600C5000U + ((i) * 0x400000U))
#define OUTPUTXBAR7_FLAGS_BASE_FRAME(i)      (0x600C6000U + ((i) * 0x400000U))
#define OUTPUTXBAR8_FLAGS_BASE_FRAME(i)      (0x600C7000U + ((i) * 0x400000U))
#define OUTPUTXBAR9_FLAGS_BASE_FRAME(i)      (0x600C8000U + ((i) * 0x400000U))
#define OUTPUTXBAR10_FLAGS_BASE_FRAME(i)     (0x600C9000U + ((i) * 0x400000U))
#define OUTPUTXBAR11_FLAGS_BASE_FRAME(i)     (0x600CA000U + ((i) * 0x400000U))
#define OUTPUTXBAR12_FLAGS_BASE_FRAME(i)     (0x600CB000U + ((i) * 0x400000U))
#define OUTPUTXBAR13_FLAGS_BASE_FRAME(i)     (0x600CC000U + ((i) * 0x400000U))
#define OUTPUTXBAR14_FLAGS_BASE_FRAME(i)     (0x600CD000U + ((i) * 0x400000U))
#define OUTPUTXBAR15_FLAGS_BASE_FRAME(i)     (0x600CE000U + ((i) * 0x400000U))
#define OUTPUTXBAR16_FLAGS_BASE_FRAME(i)     (0x600CF000U + ((i) * 0x400000U))
#define XBAR_BASE_FRAME(i)                   (0x600E0000U + ((i) * 0x400000U))
#define CPU1DLTFIFO_BASE_FRAME(i)            (0x600F8000U + ((i) * 0x400000U))
#define CPU2DLTFIFO_BASE_FRAME(i)            (0x600FA000U + ((i) * 0x400000U))
#define CPU3DLTFIFO_BASE_FRAME(i)            (0x600FC000U + ((i) * 0x400000U))
#define EPWM1_BASE_FRAME(i)                  (0x70000000U + ((i) * 0x400000U))
#define EPWM1XCMP_BASE_FRAME(i)              (0x70000400U + ((i) * 0x400000U))
#define EPWM1DE_BASE_FRAME(i)                (0x70000800U + ((i) * 0x400000U))
#define EPWM1MINDBLUT_BASE_FRAME(i)          (0x70000C00U + ((i) * 0x400000U))
#define EPWM2_BASE_FRAME(i)                  (0x70001000U + ((i) * 0x400000U))
#define EPWM2XCMP_BASE_FRAME(i)              (0x70001400U + ((i) * 0x400000U))
#define EPWM2DE_BASE_FRAME(i)                (0x70001800U + ((i) * 0x400000U))
#define EPWM2MINDBLUT_BASE_FRAME(i)          (0x70001C00U + ((i) * 0x400000U))
#define EPWM3_BASE_FRAME(i)                  (0x70002000U + ((i) * 0x400000U))
#define EPWM3XCMP_BASE_FRAME(i)              (0x70002400U + ((i) * 0x400000U))
#define EPWM3DE_BASE_FRAME(i)                (0x70002800U + ((i) * 0x400000U))
#define EPWM3MINDBLUT_BASE_FRAME(i)          (0x70002C00U + ((i) * 0x400000U))
#define EPWM4_BASE_FRAME(i)                  (0x70003000U + ((i) * 0x400000U))
#define EPWM4XCMP_BASE_FRAME(i)              (0x70003400U + ((i) * 0x400000U))
#define EPWM4DE_BASE_FRAME(i)                (0x70003800U + ((i) * 0x400000U))
#define EPWM4MINDBLUT_BASE_FRAME(i)          (0x70003C00U + ((i) * 0x400000U))
#define EPWM5_BASE_FRAME(i)                  (0x70004000U + ((i) * 0x400000U))
#define EPWM5XCMP_BASE_FRAME(i)              (0x70004400U + ((i) * 0x400000U))
#define EPWM5DE_BASE_FRAME(i)                (0x70004800U + ((i) * 0x400000U))
#define EPWM5MINDBLUT_BASE_FRAME(i)          (0x70004C00U + ((i) * 0x400000U))
#define EPWM6_BASE_FRAME(i)                  (0x70005000U + ((i) * 0x400000U))
#define EPWM6XCMP_BASE_FRAME(i)              (0x70005400U + ((i) * 0x400000U))
#define EPWM6DE_BASE_FRAME(i)                (0x70005800U + ((i) * 0x400000U))
#define EPWM6MINDBLUT_BASE_FRAME(i)          (0x70005C00U + ((i) * 0x400000U))
#define EPWM7_BASE_FRAME(i)                  (0x70006000U + ((i) * 0x400000U))
#define EPWM7XCMP_BASE_FRAME(i)              (0x70006400U + ((i) * 0x400000U))
#define EPWM7DE_BASE_FRAME(i)                (0x70006800U + ((i) * 0x400000U))
#define EPWM7MINDBLUT_BASE_FRAME(i)          (0x70006C00U + ((i) * 0x400000U))
#define EPWM8_BASE_FRAME(i)                  (0x70007000U + ((i) * 0x400000U))
#define EPWM8XCMP_BASE_FRAME(i)              (0x70007400U + ((i) * 0x400000U))
#define EPWM8DE_BASE_FRAME(i)                (0x70007800U + ((i) * 0x400000U))
#define EPWM8MINDBLUT_BASE_FRAME(i)          (0x70007C00U + ((i) * 0x400000U))
#define EPWM9_BASE_FRAME(i)                  (0x70008000U + ((i) * 0x400000U))
#define EPWM9XCMP_BASE_FRAME(i)              (0x70008400U + ((i) * 0x400000U))
#define EPWM9DE_BASE_FRAME(i)                (0x70008800U + ((i) * 0x400000U))
#define EPWM9MINDBLUT_BASE_FRAME(i)          (0x70008C00U + ((i) * 0x400000U))
#define EPWM10_BASE_FRAME(i)                 (0x70009000U + ((i) * 0x400000U))
#define EPWM10XCMP_BASE_FRAME(i)             (0x70009400U + ((i) * 0x400000U))
#define EPWM10DE_BASE_FRAME(i)               (0x70009800U + ((i) * 0x400000U))
#define EPWM10MINDBLUT_BASE_FRAME(i)         (0x70009C00U + ((i) * 0x400000U))
#define EPWM11_BASE_FRAME(i)                 (0x7000A000U + ((i) * 0x400000U))
#define EPWM11XCMP_BASE_FRAME(i)             (0x7000A400U + ((i) * 0x400000U))
#define EPWM11DE_BASE_FRAME(i)               (0x7000A800U + ((i) * 0x400000U))
#define EPWM11MINDBLUT_BASE_FRAME(i)         (0x7000AC00U + ((i) * 0x400000U))
#define EPWM12_BASE_FRAME(i)                 (0x7000B000U + ((i) * 0x400000U))
#define EPWM12XCMP_BASE_FRAME(i)             (0x7000B400U + ((i) * 0x400000U))
#define EPWM12DE_BASE_FRAME(i)               (0x7000B800U + ((i) * 0x400000U))
#define EPWM12MINDBLUT_BASE_FRAME(i)         (0x7000BC00U + ((i) * 0x400000U))
#define EPWM13_BASE_FRAME(i)                 (0x7000C000U + ((i) * 0x400000U))
#define EPWM13XCMP_BASE_FRAME(i)             (0x7000C400U + ((i) * 0x400000U))
#define EPWM13DE_BASE_FRAME(i)               (0x7000C800U + ((i) * 0x400000U))
#define EPWM13MINDBLUT_BASE_FRAME(i)         (0x7000CC00U + ((i) * 0x400000U))
#define EPWM14_BASE_FRAME(i)                 (0x7000D000U + ((i) * 0x400000U))
#define EPWM14XCMP_BASE_FRAME(i)             (0x7000D400U + ((i) * 0x400000U))
#define EPWM14DE_BASE_FRAME(i)               (0x7000D800U + ((i) * 0x400000U))
#define EPWM14MINDBLUT_BASE_FRAME(i)         (0x7000DC00U + ((i) * 0x400000U))
#define EPWM15_BASE_FRAME(i)                 (0x7000E000U + ((i) * 0x400000U))
#define EPWM15XCMP_BASE_FRAME(i)             (0x7000E400U + ((i) * 0x400000U))
#define EPWM15DE_BASE_FRAME(i)               (0x7000E800U + ((i) * 0x400000U))
#define EPWM15MINDBLUT_BASE_FRAME(i)         (0x7000EC00U + ((i) * 0x400000U))
#define EPWM16_BASE_FRAME(i)                 (0x7000F000U + ((i) * 0x400000U))
#define EPWM16XCMP_BASE_FRAME(i)             (0x7000F400U + ((i) * 0x400000U))
#define EPWM16DE_BASE_FRAME(i)               (0x7000F800U + ((i) * 0x400000U))
#define EPWM16MINDBLUT_BASE_FRAME(i)         (0x7000FC00U + ((i) * 0x400000U))
#define EPWM17_BASE_FRAME(i)                 (0x70010000U + ((i) * 0x400000U))
#define EPWM17XCMP_BASE_FRAME(i)             (0x70010400U + ((i) * 0x400000U))
#define EPWM17DE_BASE_FRAME(i)               (0x70010800U + ((i) * 0x400000U))
#define EPWM17MINDBLUT_BASE_FRAME(i)         (0x70010C00U + ((i) * 0x400000U))
#define EPWM18_BASE_FRAME(i)                 (0x70011000U + ((i) * 0x400000U))
#define EPWM18XCMP_BASE_FRAME(i)             (0x70011400U + ((i) * 0x400000U))
#define EPWM18DE_BASE_FRAME(i)               (0x70011800U + ((i) * 0x400000U))
#define EPWM18MINDBLUT_BASE_FRAME(i)         (0x70011C00U + ((i) * 0x400000U))
#define EPWM1XLINK_BASE_FRAME(i)             (0x70040000U + ((i) * 0x400000U))
#define EPWM1XCMPXLINK_BASE_FRAME(i)         (0x70040400U + ((i) * 0x400000U))
#define EPWM1DEXLINK_BASE_FRAME(i)           (0x70040800U + ((i) * 0x400000U))
#define EPWM1MINDBLUTXLINK_BASE_FRAME(i)     (0x70040C00U + ((i) * 0x400000U))
#define EPWM2XLINK_BASE_FRAME(i)             (0x70041000U + ((i) * 0x400000U))
#define EPWM2XCMPXLINK_BASE_FRAME(i)         (0x70041400U + ((i) * 0x400000U))
#define EPWM2DEXLINK_BASE_FRAME(i)           (0x70041800U + ((i) * 0x400000U))
#define EPWM2MINDBLUTXLINK_BASE_FRAME(i)     (0x70041C00U + ((i) * 0x400000U))
#define EPWM3XLINK_BASE_FRAME(i)             (0x70042000U + ((i) * 0x400000U))
#define EPWM3XCMPXLINK_BASE_FRAME(i)         (0x70042400U + ((i) * 0x400000U))
#define EPWM3DEXLINK_BASE_FRAME(i)           (0x70042800U + ((i) * 0x400000U))
#define EPWM3MINDBLUTXLINK_BASE_FRAME(i)     (0x70042C00U + ((i) * 0x400000U))
#define EPWM4XLINK_BASE_FRAME(i)             (0x70043000U + ((i) * 0x400000U))
#define EPWM4XCMPXLINK_BASE_FRAME(i)         (0x70043400U + ((i) * 0x400000U))
#define EPWM4DEXLINK_BASE_FRAME(i)           (0x70043800U + ((i) * 0x400000U))
#define EPWM4MINDBLUTXLINK_BASE_FRAME(i)     (0x70043C00U + ((i) * 0x400000U))
#define EPWM5XLINK_BASE_FRAME(i)             (0x70044000U + ((i) * 0x400000U))
#define EPWM5XCMPXLINK_BASE_FRAME(i)         (0x70044400U + ((i) * 0x400000U))
#define EPWM5DEXLINK_BASE_FRAME(i)           (0x70044800U + ((i) * 0x400000U))
#define EPWM5MINDBLUTXLINK_BASE_FRAME(i)     (0x70044C00U + ((i) * 0x400000U))
#define EPWM6XLINK_BASE_FRAME(i)             (0x70045000U + ((i) * 0x400000U))
#define EPWM6XCMPXLINK_BASE_FRAME(i)         (0x70045400U + ((i) * 0x400000U))
#define EPWM6DEXLINK_BASE_FRAME(i)           (0x70045800U + ((i) * 0x400000U))
#define EPWM6MINDBLUTXLINK_BASE_FRAME(i)     (0x70045C00U + ((i) * 0x400000U))
#define EPWM7XLINK_BASE_FRAME(i)             (0x70046000U + ((i) * 0x400000U))
#define EPWM7XCMPXLINK_BASE_FRAME(i)         (0x70046400U + ((i) * 0x400000U))
#define EPWM7DEXLINK_BASE_FRAME(i)           (0x70046800U + ((i) * 0x400000U))
#define EPWM7MINDBLUTXLINK_BASE_FRAME(i)     (0x70046C00U + ((i) * 0x400000U))
#define EPWM8XLINK_BASE_FRAME(i)             (0x70047000U + ((i) * 0x400000U))
#define EPWM8XCMPXLINK_BASE_FRAME(i)         (0x70047400U + ((i) * 0x400000U))
#define EPWM8DEXLINK_BASE_FRAME(i)           (0x70047800U + ((i) * 0x400000U))
#define EPWM8MINDBLUTXLINK_BASE_FRAME(i)     (0x70047C00U + ((i) * 0x400000U))
#define EPWM9XLINK_BASE_FRAME(i)             (0x70048000U + ((i) * 0x400000U))
#define EPWM9XCMPXLINK_BASE_FRAME(i)         (0x70048400U + ((i) * 0x400000U))
#define EPWM9DEXLINK_BASE_FRAME(i)           (0x70048800U + ((i) * 0x400000U))
#define EPWM9MINDBLUTXLINK_BASE_FRAME(i)     (0x70048C00U + ((i) * 0x400000U))
#define EPWM10XLINK_BASE_FRAME(i)            (0x70049000U + ((i) * 0x400000U))
#define EPWM10XCMPXLINK_BASE_FRAME(i)        (0x70049400U + ((i) * 0x400000U))
#define EPWM10DEXLINK_BASE_FRAME(i)          (0x70049800U + ((i) * 0x400000U))
#define EPWM10MINDBLUTXLINK_BASE_FRAME(i)    (0x70049C00U + ((i) * 0x400000U))
#define EPWM11XLINK_BASE_FRAME(i)            (0x7004A000U + ((i) * 0x400000U))
#define EPWM11XCMPXLINK_BASE_FRAME(i)        (0x7004A400U + ((i) * 0x400000U))
#define EPWM11DEXLINK_BASE_FRAME(i)          (0x7004A800U + ((i) * 0x400000U))
#define EPWM11MINDBLUTXLINK_BASE_FRAME(i)    (0x7004AC00U + ((i) * 0x400000U))
#define EPWM12XLINK_BASE_FRAME(i)            (0x7004B000U + ((i) * 0x400000U))
#define EPWM12XCMPXLINK_BASE_FRAME(i)        (0x7004B400U + ((i) * 0x400000U))
#define EPWM12DEXLINK_BASE_FRAME(i)          (0x7004B800U + ((i) * 0x400000U))
#define EPWM12MINDBLUTXLINK_BASE_FRAME(i)    (0x7004BC00U + ((i) * 0x400000U))
#define EPWM13XLINK_BASE_FRAME(i)            (0x7004C000U + ((i) * 0x400000U))
#define EPWM13XCMPXLINK_BASE_FRAME(i)        (0x7004C400U + ((i) * 0x400000U))
#define EPWM13DEXLINK_BASE_FRAME(i)          (0x7004C800U + ((i) * 0x400000U))
#define EPWM13MINDBLUTXLINK_BASE_FRAME(i)    (0x7004CC00U + ((i) * 0x400000U))
#define EPWM14XLINK_BASE_FRAME(i)            (0x7004D000U + ((i) * 0x400000U))
#define EPWM14XCMPXLINK_BASE_FRAME(i)        (0x7004D400U + ((i) * 0x400000U))
#define EPWM14DEXLINK_BASE_FRAME(i)          (0x7004D800U + ((i) * 0x400000U))
#define EPWM14MINDBLUTXLINK_BASE_FRAME(i)    (0x7004DC00U + ((i) * 0x400000U))
#define EPWM15XLINK_BASE_FRAME(i)            (0x7004E000U + ((i) * 0x400000U))
#define EPWM15XCMPXLINK_BASE_FRAME(i)        (0x7004E400U + ((i) * 0x400000U))
#define EPWM15DEXLINK_BASE_FRAME(i)          (0x7004E800U + ((i) * 0x400000U))
#define EPWM15MINDBLUTXLINK_BASE_FRAME(i)    (0x7004EC00U + ((i) * 0x400000U))
#define EPWM16XLINK_BASE_FRAME(i)            (0x7004F000U + ((i) * 0x400000U))
#define EPWM16XCMPXLINK_BASE_FRAME(i)        (0x7004F400U + ((i) * 0x400000U))
#define EPWM16DEXLINK_BASE_FRAME(i)          (0x7004F800U + ((i) * 0x400000U))
#define EPWM16MINDBLUTXLINK_BASE_FRAME(i)    (0x7004FC00U + ((i) * 0x400000U))
#define EPWM17XLINK_BASE_FRAME(i)            (0x70050000U + ((i) * 0x400000U))
#define EPWM17XCMPXLINK_BASE_FRAME(i)        (0x70050400U + ((i) * 0x400000U))
#define EPWM17DEXLINK_BASE_FRAME(i)          (0x70050800U + ((i) * 0x400000U))
#define EPWM17MINDBLUTXLINK_BASE_FRAME(i)    (0x70050C00U + ((i) * 0x400000U))
#define EPWM18XLINK_BASE_FRAME(i)            (0x70051000U + ((i) * 0x400000U))
#define EPWM18XCMPXLINK_BASE_FRAME(i)        (0x70051400U + ((i) * 0x400000U))
#define EPWM18DEXLINK_BASE_FRAME(i)          (0x70051800U + ((i) * 0x400000U))
#define EPWM18MINDBLUTXLINK_BASE_FRAME(i)    (0x70051C00U + ((i) * 0x400000U))
#define HRPWMCAL1_BASE_FRAME(i)              (0x70080000U + ((i) * 0x400000U))
#define HRPWMCAL2_BASE_FRAME(i)              (0x70081000U + ((i) * 0x400000U))
#define HRPWMCAL3_BASE_FRAME(i)              (0x70082000U + ((i) * 0x400000U))
#define EQEP1_BASE_FRAME(i)                  (0x70088000U + ((i) * 0x400000U))
#define EQEP2_BASE_FRAME(i)                  (0x70089000U + ((i) * 0x400000U))
#define EQEP3_BASE_FRAME(i)                  (0x7008A000U + ((i) * 0x400000U))
#define EQEP4_BASE_FRAME(i)                  (0x7008B000U + ((i) * 0x400000U))
#define EQEP5_BASE_FRAME(i)                  (0x7008C000U + ((i) * 0x400000U))
#define EQEP6_BASE_FRAME(i)                  (0x7008D000U + ((i) * 0x400000U))
#define SDFM1_BASE_FRAME(i)                  (0x70090000U + ((i) * 0x400000U))
#define SDFM2_BASE_FRAME(i)                  (0x70091000U + ((i) * 0x400000U))
#define SDFM3_BASE_FRAME(i)                  (0x70092000U + ((i) * 0x400000U))
#define SDFM4_BASE_FRAME(i)                  (0x70093000U + ((i) * 0x400000U))
#define ADCA_BASE_FRAME(i)                   (0x700A0000U + ((i) * 0x400000U))
#define ADCB_BASE_FRAME(i)                   (0x700A1000U + ((i) * 0x400000U))
#define ADCC_BASE_FRAME(i)                   (0x700A2000U + ((i) * 0x400000U))
#define ADCD_BASE_FRAME(i)                   (0x700A3000U + ((i) * 0x400000U))
#define ADCE_BASE_FRAME(i)                   (0x700A4000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK1_BASE_FRAME(i)        (0x700B0000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK2_BASE_FRAME(i)        (0x700B1000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK3_BASE_FRAME(i)        (0x700B2000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK4_BASE_FRAME(i)        (0x700B3000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK5_BASE_FRAME(i)        (0x700B4000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK6_BASE_FRAME(i)        (0x700B5000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK7_BASE_FRAME(i)        (0x700B6000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK8_BASE_FRAME(i)        (0x700B7000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK9_BASE_FRAME(i)        (0x700B8000U + ((i) * 0x400000U))
#define ADCSAFETYCHECK10_BASE_FRAME(i)       (0x700B9000U + ((i) * 0x400000U))
#define ADCSAFETYCHECKINTEVT1_BASE_FRAME(i)  (0x700C0000U + ((i) * 0x400000U))
#define ADCSAFETYCHECKINTEVT2_BASE_FRAME(i)  (0x700C1000U + ((i) * 0x400000U))
#define ADCSAFETYCHECKINTEVT3_BASE_FRAME(i)  (0x700C2000U + ((i) * 0x400000U))
#define ADCGLOBAL_BASE_FRAME(i)              (0x700C8000U + ((i) * 0x400000U))
#define DACA_BASE_FRAME(i)                   (0x700D0000U + ((i) * 0x400000U))
#define DACB_BASE_FRAME(i)                   (0x700D1000U + ((i) * 0x400000U))
#define CMPSS1_BASE_FRAME(i)                 (0x700E0000U + ((i) * 0x400000U))
#define CMPSS2_BASE_FRAME(i)                 (0x700E1000U + ((i) * 0x400000U))
#define CMPSS3_BASE_FRAME(i)                 (0x700E2000U + ((i) * 0x400000U))
#define CMPSS4_BASE_FRAME(i)                 (0x700E3000U + ((i) * 0x400000U))
#define CMPSS5_BASE_FRAME(i)                 (0x700E4000U + ((i) * 0x400000U))
#define CMPSS6_BASE_FRAME(i)                 (0x700E5000U + ((i) * 0x400000U))
#define CMPSS7_BASE_FRAME(i)                 (0x700E6000U + ((i) * 0x400000U))
#define CMPSS8_BASE_FRAME(i)                 (0x700E7000U + ((i) * 0x400000U))
#define CMPSS9_BASE_FRAME(i)                 (0x700E8000U + ((i) * 0x400000U))
#define CMPSS10_BASE_FRAME(i)                (0x700E9000U + ((i) * 0x400000U))
#define CMPSS11_BASE_FRAME(i)                (0x700EA000U + ((i) * 0x400000U))
#define CMPSS12_BASE_FRAME(i)                (0x700EB000U + ((i) * 0x400000U))
#define ECAP1_BASE_FRAME(i)                  (0x70100000U + ((i) * 0x400000U))
#define ECAP1SIGNALMONITORING_BASE_FRAME(i)  (0x70100080U + ((i) * 0x400000U))
#define ECAP2_BASE_FRAME(i)                  (0x70101000U + ((i) * 0x400000U))
#define ECAP2SIGNALMONITORING_BASE_FRAME(i)  (0x70101080U + ((i) * 0x400000U))
#define ECAP3_BASE_FRAME(i)                  (0x70102000U + ((i) * 0x400000U))
#define ECAP3SIGNALMONITORING_BASE_FRAME(i)  (0x70102080U + ((i) * 0x400000U))
#define ECAP4_BASE_FRAME(i)                  (0x70103000U + ((i) * 0x400000U))
#define ECAP4SIGNALMONITORING_BASE_FRAME(i)  (0x70103080U + ((i) * 0x400000U))
#define ECAP5_BASE_FRAME(i)                  (0x70104000U + ((i) * 0x400000U))
#define HRCAP5_BASE_FRAME(i)                 (0x70104040U + ((i) * 0x400000U))
