TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memmap.h
#define ECAP5SIGNALMONITORING_BASE_FRAME(i)  (0x70104080U + ((i) * 0x400000U))
#define ECAP6_BASE_FRAME(i)                  (0x70105000U + ((i) * 0x400000U))
#define HRCAP6_BASE_FRAME(i)                 (0x70105040U + ((i) * 0x400000U))
#define ECAP6SIGNALMONITORING_BASE_FRAME(i)  (0x70105080U + ((i) * 0x400000U))
#define CLB1_BASE_FRAME(i)                   (0x70120000U + ((i) * 0x400000U))
#define CLB1_LOGICCFG_BASE_FRAME(i)          (0x70120000U + ((i) * 0x400000U))
#define CLB1_LOGICCTRL_BASE_FRAME(i)         (0x70120200U + ((i) * 0x400000U))
#define CLB1_DATAEXCH_BASE_FRAME(i)          (0x70120300U + ((i) * 0x400000U))
#define CLB2_BASE_FRAME(i)                   (0x70121000U + ((i) * 0x400000U))
#define CLB2_LOGICCFG_BASE_FRAME(i)          (0x70121000U + ((i) * 0x400000U))
#define CLB2_LOGICCTRL_BASE_FRAME(i)         (0x70121200U + ((i) * 0x400000U))
#define CLB2_DATAEXCH_BASE_FRAME(i)          (0x70121300U + ((i) * 0x400000U))
#define CLB3_BASE_FRAME(i)                   (0x70122000U + ((i) * 0x400000U))
#define CLB3_LOGICCFG_BASE_FRAME(i)          (0x70122000U + ((i) * 0x400000U))
#define CLB3_LOGICCTRL_BASE_FRAME(i)         (0x70122200U + ((i) * 0x400000U))
#define CLB3_DATAEXCH_BASE_FRAME(i)          (0x70122300U + ((i) * 0x400000U))
#define CLB4_BASE_FRAME(i)                   (0x70123000U + ((i) * 0x400000U))
#define CLB4_LOGICCFG_BASE_FRAME(i)          (0x70123000U + ((i) * 0x400000U))
#define CLB4_LOGICCTRL_BASE_FRAME(i)         (0x70123200U + ((i) * 0x400000U))
#define CLB4_DATAEXCH_BASE_FRAME(i)          (0x70123300U + ((i) * 0x400000U))
#define CLB5_BASE_FRAME(i)                   (0x70124000U + ((i) * 0x400000U))
#define CLB5_LOGICCFG_BASE_FRAME(i)          (0x70124000U + ((i) * 0x400000U))
#define CLB5_LOGICCTRL_BASE_FRAME(i)         (0x70124200U + ((i) * 0x400000U))
#define CLB5_DATAEXCH_BASE_FRAME(i)          (0x70124300U + ((i) * 0x400000U))
#define CLB6_BASE_FRAME(i)                   (0x70125000U + ((i) * 0x400000U))
#define CLB6_LOGICCFG_BASE_FRAME(i)          (0x70125000U + ((i) * 0x400000U))
#define CLB6_LOGICCTRL_BASE_FRAME(i)         (0x70125200U + ((i) * 0x400000U))
#define CLB6_DATAEXCH_BASE_FRAME(i)          (0x70125300U + ((i) * 0x400000U))
#define PMBUSA_BASE_FRAME(i)                 (0x70148000U + ((i) * 0x400000U))
#define I2CA_BASE_FRAME(i)                   (0x70150000U + ((i) * 0x400000U))
#define I2CB_BASE_FRAME(i)                   (0x70151000U + ((i) * 0x400000U))
#define SPIA_BASE_FRAME(i)                   (0x70158000U + ((i) * 0x400000U))
#define SPIB_BASE_FRAME(i)                   (0x70159000U + ((i) * 0x400000U))
#define SPIC_BASE_FRAME(i)                   (0x7015A000U + ((i) * 0x400000U))
#define SPID_BASE_FRAME(i)                   (0x7015B000U + ((i) * 0x400000U))
#define SPIE_BASE_FRAME(i)                   (0x7015C000U + ((i) * 0x400000U))
#define FSITXA_BASE_FRAME(i)                 (0x70180000U + ((i) * 0x400000U))
#define FSITXB_BASE_FRAME(i)                 (0x70181000U + ((i) * 0x400000U))
#define FSITXC_BASE_FRAME(i)                 (0x70182000U + ((i) * 0x400000U))
#define FSITXD_BASE_FRAME(i)                 (0x70183000U + ((i) * 0x400000U))
#define FSIRXA_BASE_FRAME(i)                 (0x70188000U + ((i) * 0x400000U))
#define FSIRXB_BASE_FRAME(i)                 (0x70189000U + ((i) * 0x400000U))
#define FSIRXC_BASE_FRAME(i)                 (0x7018A000U + ((i) * 0x400000U))
#define FSIRXD_BASE_FRAME(i)                 (0x7018B000U + ((i) * 0x400000U))
#define EPG_BASE_FRAME(i)                    (0x701C0000U + ((i) * 0x400000U))
#define EPGMUX_BASE_FRAME(i)                 (0x701C0200U + ((i) * 0x400000U))

#ifdef USE_PERIPHERAL_FRAMES
    #include "peripheral_frame_mapping.h"
#endif
//
// Default mapping if USE_PERIPHERAL_FRAMES is not enabled or
// if _BASE macro mapping is not added in peripheral_frame_mapping.h
//
#ifndef RTDMA1CH1_BASE
    #define RTDMA1CH1_BASE                   RTDMA1CH1_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH2_BASE
    #define RTDMA1CH2_BASE                   RTDMA1CH2_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH3_BASE
    #define RTDMA1CH3_BASE                   RTDMA1CH3_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH4_BASE
    #define RTDMA1CH4_BASE                   RTDMA1CH4_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH5_BASE
    #define RTDMA1CH5_BASE                   RTDMA1CH5_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH6_BASE
    #define RTDMA1CH6_BASE                   RTDMA1CH6_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH7_BASE
    #define RTDMA1CH7_BASE                   RTDMA1CH7_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH8_BASE
    #define RTDMA1CH8_BASE                   RTDMA1CH8_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH9_BASE
    #define RTDMA1CH9_BASE                   RTDMA1CH9_BASE_FRAME(0U)
#endif
#ifndef RTDMA1CH10_BASE
    #define RTDMA1CH10_BASE                  RTDMA1CH10_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH1_BASE
    #define RTDMA2CH1_BASE                   RTDMA2CH1_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH2_BASE
    #define RTDMA2CH2_BASE                   RTDMA2CH2_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH3_BASE
    #define RTDMA2CH3_BASE                   RTDMA2CH3_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH4_BASE
    #define RTDMA2CH4_BASE                   RTDMA2CH4_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH5_BASE
    #define RTDMA2CH5_BASE                   RTDMA2CH5_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH6_BASE
    #define RTDMA2CH6_BASE                   RTDMA2CH6_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH7_BASE
    #define RTDMA2CH7_BASE                   RTDMA2CH7_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH8_BASE
    #define RTDMA2CH8_BASE                   RTDMA2CH8_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH9_BASE
    #define RTDMA2CH9_BASE                   RTDMA2CH9_BASE_FRAME(0U)
#endif
#ifndef RTDMA2CH10_BASE
    #define RTDMA2CH10_BASE                  RTDMA2CH10_BASE_FRAME(0U)
#endif
#ifndef MCANA_DRIVER_BASE
    #define MCANA_DRIVER_BASE                MCANA_DRIVER_BASE_FRAME(0U)
#endif
#ifndef MCANASS_BASE
    #define MCANASS_BASE                     MCANASS_BASE_FRAME(0U)
#endif
#ifndef MCANA_BASE
    #define MCANA_BASE                       MCANA_BASE_FRAME(0U)
#endif
#ifndef MCANA_ERROR_BASE
    #define MCANA_ERROR_BASE                 MCANA_ERROR_BASE_FRAME(0U)
#endif
#ifndef MCANB_DRIVER_BASE
    #define MCANB_DRIVER_BASE                MCANB_DRIVER_BASE_FRAME(0U)
#endif
#ifndef MCANBSS_BASE
    #define MCANBSS_BASE                     MCANBSS_BASE_FRAME(0U)
#endif
#ifndef MCANB_BASE
    #define MCANB_BASE                       MCANB_BASE_FRAME(0U)
#endif
#ifndef MCANB_ERROR_BASE
    #define MCANB_ERROR_BASE                 MCANB_ERROR_BASE_FRAME(0U)
#endif
#ifndef MCANC_DRIVER_BASE
    #define MCANC_DRIVER_BASE                MCANC_DRIVER_BASE_FRAME(0U)
#endif
#ifndef MCANCSS_BASE
    #define MCANCSS_BASE                     MCANCSS_BASE_FRAME(0U)
#endif
#ifndef MCANC_BASE
    #define MCANC_BASE                       MCANC_BASE_FRAME(0U)
#endif
#ifndef MCANC_ERROR_BASE
    #define MCANC_ERROR_BASE                 MCANC_ERROR_BASE_FRAME(0U)
#endif
#ifndef MCAND_DRIVER_BASE
    #define MCAND_DRIVER_BASE                MCAND_DRIVER_BASE_FRAME(0U)
#endif
#ifndef MCANDSS_BASE
    #define MCANDSS_BASE                     MCANDSS_BASE_FRAME(0U)
#endif
#ifndef MCAND_BASE
    #define MCAND_BASE                       MCAND_BASE_FRAME(0U)
#endif
#ifndef MCAND_ERROR_BASE
    #define MCAND_ERROR_BASE                 MCAND_ERROR_BASE_FRAME(0U)
#endif
#ifndef MCANE_DRIVER_BASE
    #define MCANE_DRIVER_BASE                MCANE_DRIVER_BASE_FRAME(0U)
#endif
#ifndef MCANESS_BASE
    #define MCANESS_BASE                     MCANESS_BASE_FRAME(0U)
#endif
#ifndef MCANE_BASE
    #define MCANE_BASE                       MCANE_BASE_FRAME(0U)
#endif
#ifndef MCANE_ERROR_BASE
    #define MCANE_ERROR_BASE                 MCANE_ERROR_BASE_FRAME(0U)
#endif
#ifndef MCANF_DRIVER_BASE
    #define MCANF_DRIVER_BASE                MCANF_DRIVER_BASE_FRAME(0U)
#endif
#ifndef MCANFSS_BASE
    #define MCANFSS_BASE                     MCANFSS_BASE_FRAME(0U)
#endif
#ifndef MCANF_BASE
    #define MCANF_BASE                       MCANF_BASE_FRAME(0U)
#endif
#ifndef MCANF_ERROR_BASE
    #define MCANF_ERROR_BASE                 MCANF_ERROR_BASE_FRAME(0U)
#endif
#ifndef LINA_BASE
    #define LINA_BASE                        LINA_BASE_FRAME(0U)
#endif
#ifndef LINB_BASE
    #define LINB_BASE                        LINB_BASE_FRAME(0U)
#endif
#ifndef SENT1_BASE
    #define SENT1_BASE                       SENT1_BASE_FRAME(0U)
#endif
#ifndef SENT2_BASE
    #define SENT2_BASE                       SENT2_BASE_FRAME(0U)
#endif
#ifndef SENT3_BASE
    #define SENT3_BASE                       SENT3_BASE_FRAME(0U)
#endif
#ifndef SENT4_BASE
    #define SENT4_BASE                       SENT4_BASE_FRAME(0U)
#endif
#ifndef SENT5_BASE
    #define SENT5_BASE                       SENT5_BASE_FRAME(0U)
#endif
#ifndef SENT6_BASE
    #define SENT6_BASE                       SENT6_BASE_FRAME(0U)
#endif
#ifndef UARTA_WRITE_BASE
    #define UARTA_WRITE_BASE                 UARTA_WRITE_BASE_FRAME(0U)
#endif
#ifndef UARTA_BASE
    #define UARTA_BASE                       UARTA_BASE_FRAME(0U)
#endif
#ifndef UARTB_WRITE_BASE
    #define UARTB_WRITE_BASE                 UARTB_WRITE_BASE_FRAME(0U)
#endif
#ifndef UARTB_BASE
    #define UARTB_BASE                       UARTB_BASE_FRAME(0U)
#endif
#ifndef UARTC_WRITE_BASE
    #define UARTC_WRITE_BASE                 UARTC_WRITE_BASE_FRAME(0U)
#endif
#ifndef UARTC_BASE
    #define UARTC_BASE                       UARTC_BASE_FRAME(0U)
#endif
#ifndef UARTD_WRITE_BASE
    #define UARTD_WRITE_BASE                 UARTD_WRITE_BASE_FRAME(0U)
#endif
#ifndef UARTD_BASE
    #define UARTD_BASE                       UARTD_BASE_FRAME(0U)
#endif
#ifndef UARTE_WRITE_BASE
    #define UARTE_WRITE_BASE                 UARTE_WRITE_BASE_FRAME(0U)
#endif
#ifndef UARTE_BASE
    #define UARTE_BASE                       UARTE_BASE_FRAME(0U)
#endif
#ifndef UARTF_WRITE_BASE
    #define UARTF_WRITE_BASE                 UARTF_WRITE_BASE_FRAME(0U)
#endif
#ifndef UARTF_BASE
    #define UARTF_BASE                       UARTF_BASE_FRAME(0U)
#endif
#ifndef DCC1_BASE
    #define DCC1_BASE                        DCC1_BASE_FRAME(0U)
#endif
#ifndef DCC2_BASE
    #define DCC2_BASE                        DCC2_BASE_FRAME(0U)
#endif
#ifndef DCC3_BASE
    #define DCC3_BASE                        DCC3_BASE_FRAME(0U)
#endif
#ifndef ERRORAGGREGATOR_BASE
    #define ERRORAGGREGATOR_BASE             ERRORAGGREGATOR_BASE_FRAME(0U)
#endif
#ifndef ESMCPU1_BASE
    #define ESMCPU1_BASE                     ESMCPU1_BASE_FRAME(0U)
#endif
#ifndef ESMCPU2_BASE
    #define ESMCPU2_BASE                     ESMCPU2_BASE_FRAME(0U)
#endif
#ifndef ESMCPU3_BASE
    #define ESMCPU3_BASE                     ESMCPU3_BASE_FRAME(0U)
#endif
#ifndef ESMSYSTEM_BASE
    #define ESMSYSTEM_BASE                   ESMSYSTEM_BASE_FRAME(0U)
#endif
#ifndef ESMSAFETYAGG_BASE
    #define ESMSAFETYAGG_BASE                ESMSAFETYAGG_BASE_FRAME(0U)
#endif
#ifndef WADI1BLK1CONFIG_BASE
    #define WADI1BLK1CONFIG_BASE             WADI1BLK1CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI1BLK2CONFIG_BASE
    #define WADI1BLK2CONFIG_BASE             WADI1BLK2CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI1BLK3CONFIG_BASE
    #define WADI1BLK3CONFIG_BASE             WADI1BLK3CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI1BLK4CONFIG_BASE
    #define WADI1BLK4CONFIG_BASE             WADI1BLK4CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI1OPERSSS_BASE
    #define WADI1OPERSSS_BASE                WADI1OPERSSS_BASE_FRAME(0U)
#endif
#ifndef WADI2BLK1CONFIG_BASE
    #define WADI2BLK1CONFIG_BASE             WADI2BLK1CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI2BLK2CONFIG_BASE
    #define WADI2BLK2CONFIG_BASE             WADI2BLK2CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI2BLK3CONFIG_BASE
    #define WADI2BLK3CONFIG_BASE             WADI2BLK3CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI2BLK4CONFIG_BASE
    #define WADI2BLK4CONFIG_BASE             WADI2BLK4CONFIG_BASE_FRAME(0U)
#endif
#ifndef WADI2OPERSSS_BASE
    #define WADI2OPERSSS_BASE                WADI2OPERSSS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR1_FLAGS_BASE
    #define OUTPUTXBAR1_FLAGS_BASE           OUTPUTXBAR1_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR2_FLAGS_BASE
    #define OUTPUTXBAR2_FLAGS_BASE           OUTPUTXBAR2_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR3_FLAGS_BASE
    #define OUTPUTXBAR3_FLAGS_BASE           OUTPUTXBAR3_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR4_FLAGS_BASE
    #define OUTPUTXBAR4_FLAGS_BASE           OUTPUTXBAR4_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR5_FLAGS_BASE
    #define OUTPUTXBAR5_FLAGS_BASE           OUTPUTXBAR5_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR6_FLAGS_BASE
    #define OUTPUTXBAR6_FLAGS_BASE           OUTPUTXBAR6_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR7_FLAGS_BASE
    #define OUTPUTXBAR7_FLAGS_BASE           OUTPUTXBAR7_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR8_FLAGS_BASE
    #define OUTPUTXBAR8_FLAGS_BASE           OUTPUTXBAR8_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR9_FLAGS_BASE
    #define OUTPUTXBAR9_FLAGS_BASE           OUTPUTXBAR9_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR10_FLAGS_BASE
    #define OUTPUTXBAR10_FLAGS_BASE          OUTPUTXBAR10_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR11_FLAGS_BASE
    #define OUTPUTXBAR11_FLAGS_BASE          OUTPUTXBAR11_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR12_FLAGS_BASE
    #define OUTPUTXBAR12_FLAGS_BASE          OUTPUTXBAR12_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR13_FLAGS_BASE
    #define OUTPUTXBAR13_FLAGS_BASE          OUTPUTXBAR13_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR14_FLAGS_BASE
    #define OUTPUTXBAR14_FLAGS_BASE          OUTPUTXBAR14_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR15_FLAGS_BASE
    #define OUTPUTXBAR15_FLAGS_BASE          OUTPUTXBAR15_FLAGS_BASE_FRAME(0U)
#endif
#ifndef OUTPUTXBAR16_FLAGS_BASE
    #define OUTPUTXBAR16_FLAGS_BASE          OUTPUTXBAR16_FLAGS_BASE_FRAME(0U)
#endif
#ifndef XBAR_BASE
    #define XBAR_BASE                        XBAR_BASE_FRAME(0U)
#endif
#ifndef CPU1DLTFIFO_BASE
    #define CPU1DLTFIFO_BASE                 CPU1DLTFIFO_BASE_FRAME(0U)
#endif
#ifndef CPU2DLTFIFO_BASE
    #define CPU2DLTFIFO_BASE                 CPU2DLTFIFO_BASE_FRAME(0U)
#endif
#ifndef CPU3DLTFIFO_BASE
    #define CPU3DLTFIFO_BASE                 CPU3DLTFIFO_BASE_FRAME(0U)
#endif
#ifndef EPWM1_BASE
    #define EPWM1_BASE                       EPWM1_BASE_FRAME(0U)
#endif
#ifndef EPWM1XCMP_BASE
    #define EPWM1XCMP_BASE                   EPWM1XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM1DE_BASE
    #define EPWM1DE_BASE                     EPWM1DE_BASE_FRAME(0U)
#endif
#ifndef EPWM1MINDBLUT_BASE
    #define EPWM1MINDBLUT_BASE               EPWM1MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM2_BASE
    #define EPWM2_BASE                       EPWM2_BASE_FRAME(0U)
#endif
#ifndef EPWM2XCMP_BASE
    #define EPWM2XCMP_BASE                   EPWM2XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM2DE_BASE
    #define EPWM2DE_BASE                     EPWM2DE_BASE_FRAME(0U)
#endif
#ifndef EPWM2MINDBLUT_BASE
    #define EPWM2MINDBLUT_BASE               EPWM2MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM3_BASE
    #define EPWM3_BASE                       EPWM3_BASE_FRAME(0U)
#endif
#ifndef EPWM3XCMP_BASE
    #define EPWM3XCMP_BASE                   EPWM3XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM3DE_BASE
    #define EPWM3DE_BASE                     EPWM3DE_BASE_FRAME(0U)
#endif
#ifndef EPWM3MINDBLUT_BASE
    #define EPWM3MINDBLUT_BASE               EPWM3MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM4_BASE
    #define EPWM4_BASE                       EPWM4_BASE_FRAME(0U)
#endif
#ifndef EPWM4XCMP_BASE
    #define EPWM4XCMP_BASE                   EPWM4XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM4DE_BASE
    #define EPWM4DE_BASE                     EPWM4DE_BASE_FRAME(0U)
#endif
#ifndef EPWM4MINDBLUT_BASE
    #define EPWM4MINDBLUT_BASE               EPWM4MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM5_BASE
    #define EPWM5_BASE                       EPWM5_BASE_FRAME(0U)
#endif
#ifndef EPWM5XCMP_BASE
    #define EPWM5XCMP_BASE                   EPWM5XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM5DE_BASE
    #define EPWM5DE_BASE                     EPWM5DE_BASE_FRAME(0U)
#endif
#ifndef EPWM5MINDBLUT_BASE
    #define EPWM5MINDBLUT_BASE               EPWM5MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM6_BASE
    #define EPWM6_BASE                       EPWM6_BASE_FRAME(0U)
#endif
#ifndef EPWM6XCMP_BASE
    #define EPWM6XCMP_BASE                   EPWM6XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM6DE_BASE
    #define EPWM6DE_BASE                     EPWM6DE_BASE_FRAME(0U)
#endif
#ifndef EPWM6MINDBLUT_BASE
    #define EPWM6MINDBLUT_BASE               EPWM6MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM7_BASE
    #define EPWM7_BASE                       EPWM7_BASE_FRAME(0U)
#endif
#ifndef EPWM7XCMP_BASE
    #define EPWM7XCMP_BASE                   EPWM7XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM7DE_BASE
    #define EPWM7DE_BASE                     EPWM7DE_BASE_FRAME(0U)
#endif
#ifndef EPWM7MINDBLUT_BASE
    #define EPWM7MINDBLUT_BASE               EPWM7MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM8_BASE
    #define EPWM8_BASE                       EPWM8_BASE_FRAME(0U)
#endif
#ifndef EPWM8XCMP_BASE
    #define EPWM8XCMP_BASE                   EPWM8XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM8DE_BASE
    #define EPWM8DE_BASE                     EPWM8DE_BASE_FRAME(0U)
#endif
#ifndef EPWM8MINDBLUT_BASE
    #define EPWM8MINDBLUT_BASE               EPWM8MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM9_BASE
    #define EPWM9_BASE                       EPWM9_BASE_FRAME(0U)
#endif
#ifndef EPWM9XCMP_BASE
    #define EPWM9XCMP_BASE                   EPWM9XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM9DE_BASE
    #define EPWM9DE_BASE                     EPWM9DE_BASE_FRAME(0U)
#endif
#ifndef EPWM9MINDBLUT_BASE
    #define EPWM9MINDBLUT_BASE               EPWM9MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM10_BASE
    #define EPWM10_BASE                      EPWM10_BASE_FRAME(0U)
#endif
#ifndef EPWM10XCMP_BASE
    #define EPWM10XCMP_BASE                  EPWM10XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM10DE_BASE
    #define EPWM10DE_BASE                    EPWM10DE_BASE_FRAME(0U)
#endif
#ifndef EPWM10MINDBLUT_BASE
    #define EPWM10MINDBLUT_BASE              EPWM10MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM11_BASE
    #define EPWM11_BASE                      EPWM11_BASE_FRAME(0U)
#endif
#ifndef EPWM11XCMP_BASE
    #define EPWM11XCMP_BASE                  EPWM11XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM11DE_BASE
    #define EPWM11DE_BASE                    EPWM11DE_BASE_FRAME(0U)
#endif
#ifndef EPWM11MINDBLUT_BASE
    #define EPWM11MINDBLUT_BASE              EPWM11MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM12_BASE
    #define EPWM12_BASE                      EPWM12_BASE_FRAME(0U)
#endif
#ifndef EPWM12XCMP_BASE
    #define EPWM12XCMP_BASE                  EPWM12XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM12DE_BASE
    #define EPWM12DE_BASE                    EPWM12DE_BASE_FRAME(0U)
#endif
#ifndef EPWM12MINDBLUT_BASE
    #define EPWM12MINDBLUT_BASE              EPWM12MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM13_BASE
    #define EPWM13_BASE                      EPWM13_BASE_FRAME(0U)
#endif
#ifndef EPWM13XCMP_BASE
    #define EPWM13XCMP_BASE                  EPWM13XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM13DE_BASE
    #define EPWM13DE_BASE                    EPWM13DE_BASE_FRAME(0U)
#endif
#ifndef EPWM13MINDBLUT_BASE
    #define EPWM13MINDBLUT_BASE              EPWM13MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM14_BASE
    #define EPWM14_BASE                      EPWM14_BASE_FRAME(0U)
#endif
#ifndef EPWM14XCMP_BASE
    #define EPWM14XCMP_BASE                  EPWM14XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM14DE_BASE
    #define EPWM14DE_BASE                    EPWM14DE_BASE_FRAME(0U)
#endif
#ifndef EPWM14MINDBLUT_BASE
    #define EPWM14MINDBLUT_BASE              EPWM14MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM15_BASE
    #define EPWM15_BASE                      EPWM15_BASE_FRAME(0U)
#endif
#ifndef EPWM15XCMP_BASE
    #define EPWM15XCMP_BASE                  EPWM15XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM15DE_BASE
    #define EPWM15DE_BASE                    EPWM15DE_BASE_FRAME(0U)
#endif
#ifndef EPWM15MINDBLUT_BASE
    #define EPWM15MINDBLUT_BASE              EPWM15MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM16_BASE
    #define EPWM16_BASE                      EPWM16_BASE_FRAME(0U)
#endif
#ifndef EPWM16XCMP_BASE
    #define EPWM16XCMP_BASE                  EPWM16XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM16DE_BASE
    #define EPWM16DE_BASE                    EPWM16DE_BASE_FRAME(0U)
#endif
#ifndef EPWM16MINDBLUT_BASE
    #define EPWM16MINDBLUT_BASE              EPWM16MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM17_BASE
    #define EPWM17_BASE                      EPWM17_BASE_FRAME(0U)
#endif
#ifndef EPWM17XCMP_BASE
    #define EPWM17XCMP_BASE                  EPWM17XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM17DE_BASE
    #define EPWM17DE_BASE                    EPWM17DE_BASE_FRAME(0U)
#endif
#ifndef EPWM17MINDBLUT_BASE
    #define EPWM17MINDBLUT_BASE              EPWM17MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM18_BASE
    #define EPWM18_BASE                      EPWM18_BASE_FRAME(0U)
#endif
#ifndef EPWM18XCMP_BASE
    #define EPWM18XCMP_BASE                  EPWM18XCMP_BASE_FRAME(0U)
#endif
#ifndef EPWM18DE_BASE
    #define EPWM18DE_BASE                    EPWM18DE_BASE_FRAME(0U)
#endif
#ifndef EPWM18MINDBLUT_BASE
    #define EPWM18MINDBLUT_BASE              EPWM18MINDBLUT_BASE_FRAME(0U)
#endif
#ifndef EPWM1XLINK_BASE
    #define EPWM1XLINK_BASE                  EPWM1XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM1XCMPXLINK_BASE
    #define EPWM1XCMPXLINK_BASE              EPWM1XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM1DEXLINK_BASE
    #define EPWM1DEXLINK_BASE                EPWM1DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM1MINDBLUTXLINK_BASE
    #define EPWM1MINDBLUTXLINK_BASE          EPWM1MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM2XLINK_BASE
    #define EPWM2XLINK_BASE                  EPWM2XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM2XCMPXLINK_BASE
    #define EPWM2XCMPXLINK_BASE              EPWM2XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM2DEXLINK_BASE
    #define EPWM2DEXLINK_BASE                EPWM2DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM2MINDBLUTXLINK_BASE
    #define EPWM2MINDBLUTXLINK_BASE          EPWM2MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM3XLINK_BASE
    #define EPWM3XLINK_BASE                  EPWM3XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM3XCMPXLINK_BASE
    #define EPWM3XCMPXLINK_BASE              EPWM3XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM3DEXLINK_BASE
    #define EPWM3DEXLINK_BASE                EPWM3DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM3MINDBLUTXLINK_BASE
    #define EPWM3MINDBLUTXLINK_BASE          EPWM3MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM4XLINK_BASE
    #define EPWM4XLINK_BASE                  EPWM4XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM4XCMPXLINK_BASE
    #define EPWM4XCMPXLINK_BASE              EPWM4XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM4DEXLINK_BASE
    #define EPWM4DEXLINK_BASE                EPWM4DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM4MINDBLUTXLINK_BASE
    #define EPWM4MINDBLUTXLINK_BASE          EPWM4MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM5XLINK_BASE
    #define EPWM5XLINK_BASE                  EPWM5XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM5XCMPXLINK_BASE
    #define EPWM5XCMPXLINK_BASE              EPWM5XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM5DEXLINK_BASE
    #define EPWM5DEXLINK_BASE                EPWM5DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM5MINDBLUTXLINK_BASE
    #define EPWM5MINDBLUTXLINK_BASE          EPWM5MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM6XLINK_BASE
    #define EPWM6XLINK_BASE                  EPWM6XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM6XCMPXLINK_BASE
    #define EPWM6XCMPXLINK_BASE              EPWM6XCMPXLINK_BASE_FRAME(0U)
#endif
