TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_memmap.h
#ifndef EPWM6DEXLINK_BASE
    #define EPWM6DEXLINK_BASE                EPWM6DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM6MINDBLUTXLINK_BASE
    #define EPWM6MINDBLUTXLINK_BASE          EPWM6MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM7XLINK_BASE
    #define EPWM7XLINK_BASE                  EPWM7XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM7XCMPXLINK_BASE
    #define EPWM7XCMPXLINK_BASE              EPWM7XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM7DEXLINK_BASE
    #define EPWM7DEXLINK_BASE                EPWM7DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM7MINDBLUTXLINK_BASE
    #define EPWM7MINDBLUTXLINK_BASE          EPWM7MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM8XLINK_BASE
    #define EPWM8XLINK_BASE                  EPWM8XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM8XCMPXLINK_BASE
    #define EPWM8XCMPXLINK_BASE              EPWM8XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM8DEXLINK_BASE
    #define EPWM8DEXLINK_BASE                EPWM8DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM8MINDBLUTXLINK_BASE
    #define EPWM8MINDBLUTXLINK_BASE          EPWM8MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM9XLINK_BASE
    #define EPWM9XLINK_BASE                  EPWM9XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM9XCMPXLINK_BASE
    #define EPWM9XCMPXLINK_BASE              EPWM9XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM9DEXLINK_BASE
    #define EPWM9DEXLINK_BASE                EPWM9DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM9MINDBLUTXLINK_BASE
    #define EPWM9MINDBLUTXLINK_BASE          EPWM9MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM10XLINK_BASE
    #define EPWM10XLINK_BASE                 EPWM10XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM10XCMPXLINK_BASE
    #define EPWM10XCMPXLINK_BASE             EPWM10XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM10DEXLINK_BASE
    #define EPWM10DEXLINK_BASE               EPWM10DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM10MINDBLUTXLINK_BASE
    #define EPWM10MINDBLUTXLINK_BASE         EPWM10MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM11XLINK_BASE
    #define EPWM11XLINK_BASE                 EPWM11XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM11XCMPXLINK_BASE
    #define EPWM11XCMPXLINK_BASE             EPWM11XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM11DEXLINK_BASE
    #define EPWM11DEXLINK_BASE               EPWM11DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM11MINDBLUTXLINK_BASE
    #define EPWM11MINDBLUTXLINK_BASE         EPWM11MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM12XLINK_BASE
    #define EPWM12XLINK_BASE                 EPWM12XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM12XCMPXLINK_BASE
    #define EPWM12XCMPXLINK_BASE             EPWM12XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM12DEXLINK_BASE
    #define EPWM12DEXLINK_BASE               EPWM12DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM12MINDBLUTXLINK_BASE
    #define EPWM12MINDBLUTXLINK_BASE         EPWM12MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM13XLINK_BASE
    #define EPWM13XLINK_BASE                 EPWM13XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM13XCMPXLINK_BASE
    #define EPWM13XCMPXLINK_BASE             EPWM13XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM13DEXLINK_BASE
    #define EPWM13DEXLINK_BASE               EPWM13DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM13MINDBLUTXLINK_BASE
    #define EPWM13MINDBLUTXLINK_BASE         EPWM13MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM14XLINK_BASE
    #define EPWM14XLINK_BASE                 EPWM14XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM14XCMPXLINK_BASE
    #define EPWM14XCMPXLINK_BASE             EPWM14XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM14DEXLINK_BASE
    #define EPWM14DEXLINK_BASE               EPWM14DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM14MINDBLUTXLINK_BASE
    #define EPWM14MINDBLUTXLINK_BASE         EPWM14MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM15XLINK_BASE
    #define EPWM15XLINK_BASE                 EPWM15XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM15XCMPXLINK_BASE
    #define EPWM15XCMPXLINK_BASE             EPWM15XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM15DEXLINK_BASE
    #define EPWM15DEXLINK_BASE               EPWM15DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM15MINDBLUTXLINK_BASE
    #define EPWM15MINDBLUTXLINK_BASE         EPWM15MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM16XLINK_BASE
    #define EPWM16XLINK_BASE                 EPWM16XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM16XCMPXLINK_BASE
    #define EPWM16XCMPXLINK_BASE             EPWM16XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM16DEXLINK_BASE
    #define EPWM16DEXLINK_BASE               EPWM16DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM16MINDBLUTXLINK_BASE
    #define EPWM16MINDBLUTXLINK_BASE         EPWM16MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM17XLINK_BASE
    #define EPWM17XLINK_BASE                 EPWM17XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM17XCMPXLINK_BASE
    #define EPWM17XCMPXLINK_BASE             EPWM17XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM17DEXLINK_BASE
    #define EPWM17DEXLINK_BASE               EPWM17DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM17MINDBLUTXLINK_BASE
    #define EPWM17MINDBLUTXLINK_BASE         EPWM17MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM18XLINK_BASE
    #define EPWM18XLINK_BASE                 EPWM18XLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM18XCMPXLINK_BASE
    #define EPWM18XCMPXLINK_BASE             EPWM18XCMPXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM18DEXLINK_BASE
    #define EPWM18DEXLINK_BASE               EPWM18DEXLINK_BASE_FRAME(0U)
#endif
#ifndef EPWM18MINDBLUTXLINK_BASE
    #define EPWM18MINDBLUTXLINK_BASE         EPWM18MINDBLUTXLINK_BASE_FRAME(0U)
#endif
#ifndef HRPWMCAL1_BASE
    #define HRPWMCAL1_BASE                   HRPWMCAL1_BASE_FRAME(0U)
#endif
#ifndef HRPWMCAL2_BASE
    #define HRPWMCAL2_BASE                   HRPWMCAL2_BASE_FRAME(0U)
#endif
#ifndef HRPWMCAL3_BASE
    #define HRPWMCAL3_BASE                   HRPWMCAL3_BASE_FRAME(0U)
#endif
#ifndef EQEP1_BASE
    #define EQEP1_BASE                       EQEP1_BASE_FRAME(0U)
#endif
#ifndef EQEP2_BASE
    #define EQEP2_BASE                       EQEP2_BASE_FRAME(0U)
#endif
#ifndef EQEP3_BASE
    #define EQEP3_BASE                       EQEP3_BASE_FRAME(0U)
#endif
#ifndef EQEP4_BASE
    #define EQEP4_BASE                       EQEP4_BASE_FRAME(0U)
#endif
#ifndef EQEP5_BASE
    #define EQEP5_BASE                       EQEP5_BASE_FRAME(0U)
#endif
#ifndef EQEP6_BASE
    #define EQEP6_BASE                       EQEP6_BASE_FRAME(0U)
#endif
#ifndef SDFM1_BASE
    #define SDFM1_BASE                       SDFM1_BASE_FRAME(0U)
#endif
#ifndef SDFM2_BASE
    #define SDFM2_BASE                       SDFM2_BASE_FRAME(0U)
#endif
#ifndef SDFM3_BASE
    #define SDFM3_BASE                       SDFM3_BASE_FRAME(0U)
#endif
#ifndef SDFM4_BASE
    #define SDFM4_BASE                       SDFM4_BASE_FRAME(0U)
#endif
#ifndef ADCA_BASE
    #define ADCA_BASE                        ADCA_BASE_FRAME(0U)
#endif
#ifndef ADCB_BASE
    #define ADCB_BASE                        ADCB_BASE_FRAME(0U)
#endif
#ifndef ADCC_BASE
    #define ADCC_BASE                        ADCC_BASE_FRAME(0U)
#endif
#ifndef ADCD_BASE
    #define ADCD_BASE                        ADCD_BASE_FRAME(0U)
#endif
#ifndef ADCE_BASE
    #define ADCE_BASE                        ADCE_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK1_BASE
    #define ADCSAFETYCHECK1_BASE             ADCSAFETYCHECK1_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK2_BASE
    #define ADCSAFETYCHECK2_BASE             ADCSAFETYCHECK2_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK3_BASE
    #define ADCSAFETYCHECK3_BASE             ADCSAFETYCHECK3_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK4_BASE
    #define ADCSAFETYCHECK4_BASE             ADCSAFETYCHECK4_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK5_BASE
    #define ADCSAFETYCHECK5_BASE             ADCSAFETYCHECK5_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK6_BASE
    #define ADCSAFETYCHECK6_BASE             ADCSAFETYCHECK6_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK7_BASE
    #define ADCSAFETYCHECK7_BASE             ADCSAFETYCHECK7_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK8_BASE
    #define ADCSAFETYCHECK8_BASE             ADCSAFETYCHECK8_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK9_BASE
    #define ADCSAFETYCHECK9_BASE             ADCSAFETYCHECK9_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECK10_BASE
    #define ADCSAFETYCHECK10_BASE            ADCSAFETYCHECK10_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECKINTEVT1_BASE
    #define ADCSAFETYCHECKINTEVT1_BASE       ADCSAFETYCHECKINTEVT1_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECKINTEVT2_BASE
    #define ADCSAFETYCHECKINTEVT2_BASE       ADCSAFETYCHECKINTEVT2_BASE_FRAME(0U)
#endif
#ifndef ADCSAFETYCHECKINTEVT3_BASE
    #define ADCSAFETYCHECKINTEVT3_BASE       ADCSAFETYCHECKINTEVT3_BASE_FRAME(0U)
#endif
#ifndef ADCGLOBAL_BASE
    #define ADCGLOBAL_BASE                   ADCGLOBAL_BASE_FRAME(0U)
#endif
#ifndef DACA_BASE
    #define DACA_BASE                        DACA_BASE_FRAME(0U)
#endif
#ifndef DACB_BASE
    #define DACB_BASE                        DACB_BASE_FRAME(0U)
#endif
#ifndef CMPSS1_BASE
    #define CMPSS1_BASE                      CMPSS1_BASE_FRAME(0U)
#endif
#ifndef CMPSS2_BASE
    #define CMPSS2_BASE                      CMPSS2_BASE_FRAME(0U)
#endif
#ifndef CMPSS3_BASE
    #define CMPSS3_BASE                      CMPSS3_BASE_FRAME(0U)
#endif
#ifndef CMPSS4_BASE
    #define CMPSS4_BASE                      CMPSS4_BASE_FRAME(0U)
#endif
#ifndef CMPSS5_BASE
    #define CMPSS5_BASE                      CMPSS5_BASE_FRAME(0U)
#endif
#ifndef CMPSS6_BASE
    #define CMPSS6_BASE                      CMPSS6_BASE_FRAME(0U)
#endif
#ifndef CMPSS7_BASE
    #define CMPSS7_BASE                      CMPSS7_BASE_FRAME(0U)
#endif
#ifndef CMPSS8_BASE
    #define CMPSS8_BASE                      CMPSS8_BASE_FRAME(0U)
#endif
#ifndef CMPSS9_BASE
    #define CMPSS9_BASE                      CMPSS9_BASE_FRAME(0U)
#endif
#ifndef CMPSS10_BASE
    #define CMPSS10_BASE                     CMPSS10_BASE_FRAME(0U)
#endif
#ifndef CMPSS11_BASE
    #define CMPSS11_BASE                     CMPSS11_BASE_FRAME(0U)
#endif
#ifndef CMPSS12_BASE
    #define CMPSS12_BASE                     CMPSS12_BASE_FRAME(0U)
#endif
#ifndef ECAP1_BASE
    #define ECAP1_BASE                       ECAP1_BASE_FRAME(0U)
#endif
#ifndef ECAP1SIGNALMONITORING_BASE
    #define ECAP1SIGNALMONITORING_BASE       ECAP1SIGNALMONITORING_BASE_FRAME(0U)
#endif
#ifndef ECAP2_BASE
    #define ECAP2_BASE                       ECAP2_BASE_FRAME(0U)
#endif
#ifndef ECAP2SIGNALMONITORING_BASE
    #define ECAP2SIGNALMONITORING_BASE       ECAP2SIGNALMONITORING_BASE_FRAME(0U)
#endif
#ifndef ECAP3_BASE
    #define ECAP3_BASE                       ECAP3_BASE_FRAME(0U)
#endif
#ifndef ECAP3SIGNALMONITORING_BASE
    #define ECAP3SIGNALMONITORING_BASE       ECAP3SIGNALMONITORING_BASE_FRAME(0U)
#endif
#ifndef ECAP4_BASE
    #define ECAP4_BASE                       ECAP4_BASE_FRAME(0U)
#endif
#ifndef ECAP4SIGNALMONITORING_BASE
    #define ECAP4SIGNALMONITORING_BASE       ECAP4SIGNALMONITORING_BASE_FRAME(0U)
#endif
#ifndef ECAP5_BASE
    #define ECAP5_BASE                       ECAP5_BASE_FRAME(0U)
#endif
#ifndef HRCAP5_BASE
    #define HRCAP5_BASE                      HRCAP5_BASE_FRAME(0U)
#endif
#ifndef ECAP5SIGNALMONITORING_BASE
    #define ECAP5SIGNALMONITORING_BASE       ECAP5SIGNALMONITORING_BASE_FRAME(0U)
#endif
#ifndef ECAP6_BASE
    #define ECAP6_BASE                       ECAP6_BASE_FRAME(0U)
#endif
#ifndef HRCAP6_BASE
    #define HRCAP6_BASE                      HRCAP6_BASE_FRAME(0U)
#endif
#ifndef ECAP6SIGNALMONITORING_BASE
    #define ECAP6SIGNALMONITORING_BASE       ECAP6SIGNALMONITORING_BASE_FRAME(0U)
#endif
#ifndef CLB1_BASE
    #define CLB1_BASE                        CLB1_BASE_FRAME(0U)
#endif
#ifndef CLB1_LOGICCFG_BASE
    #define CLB1_LOGICCFG_BASE               CLB1_LOGICCFG_BASE_FRAME(0U)
#endif
#ifndef CLB1_LOGICCTRL_BASE
    #define CLB1_LOGICCTRL_BASE              CLB1_LOGICCTRL_BASE_FRAME(0U)
#endif
#ifndef CLB1_DATAEXCH_BASE
    #define CLB1_DATAEXCH_BASE               CLB1_DATAEXCH_BASE_FRAME(0U)
#endif
#ifndef CLB2_BASE
    #define CLB2_BASE                        CLB2_BASE_FRAME(0U)
#endif
#ifndef CLB2_LOGICCFG_BASE
    #define CLB2_LOGICCFG_BASE               CLB2_LOGICCFG_BASE_FRAME(0U)
#endif
#ifndef CLB2_LOGICCTRL_BASE
    #define CLB2_LOGICCTRL_BASE              CLB2_LOGICCTRL_BASE_FRAME(0U)
#endif
#ifndef CLB2_DATAEXCH_BASE
    #define CLB2_DATAEXCH_BASE               CLB2_DATAEXCH_BASE_FRAME(0U)
#endif
#ifndef CLB3_BASE
    #define CLB3_BASE                        CLB3_BASE_FRAME(0U)
#endif
#ifndef CLB3_LOGICCFG_BASE
    #define CLB3_LOGICCFG_BASE               CLB3_LOGICCFG_BASE_FRAME(0U)
#endif
#ifndef CLB3_LOGICCTRL_BASE
    #define CLB3_LOGICCTRL_BASE              CLB3_LOGICCTRL_BASE_FRAME(0U)
#endif
#ifndef CLB3_DATAEXCH_BASE
    #define CLB3_DATAEXCH_BASE               CLB3_DATAEXCH_BASE_FRAME(0U)
#endif
#ifndef CLB4_BASE
    #define CLB4_BASE                        CLB4_BASE_FRAME(0U)
#endif
#ifndef CLB4_LOGICCFG_BASE
    #define CLB4_LOGICCFG_BASE               CLB4_LOGICCFG_BASE_FRAME(0U)
#endif
#ifndef CLB4_LOGICCTRL_BASE
    #define CLB4_LOGICCTRL_BASE              CLB4_LOGICCTRL_BASE_FRAME(0U)
#endif
#ifndef CLB4_DATAEXCH_BASE
    #define CLB4_DATAEXCH_BASE               CLB4_DATAEXCH_BASE_FRAME(0U)
#endif
#ifndef CLB5_BASE
    #define CLB5_BASE                        CLB5_BASE_FRAME(0U)
#endif
#ifndef CLB5_LOGICCFG_BASE
    #define CLB5_LOGICCFG_BASE               CLB5_LOGICCFG_BASE_FRAME(0U)
#endif
#ifndef CLB5_LOGICCTRL_BASE
    #define CLB5_LOGICCTRL_BASE              CLB5_LOGICCTRL_BASE_FRAME(0U)
#endif
#ifndef CLB5_DATAEXCH_BASE
    #define CLB5_DATAEXCH_BASE               CLB5_DATAEXCH_BASE_FRAME(0U)
#endif
#ifndef CLB6_BASE
    #define CLB6_BASE                        CLB6_BASE_FRAME(0U)
#endif
#ifndef CLB6_LOGICCFG_BASE
    #define CLB6_LOGICCFG_BASE               CLB6_LOGICCFG_BASE_FRAME(0U)
#endif
#ifndef CLB6_LOGICCTRL_BASE
    #define CLB6_LOGICCTRL_BASE              CLB6_LOGICCTRL_BASE_FRAME(0U)
#endif
#ifndef CLB6_DATAEXCH_BASE
    #define CLB6_DATAEXCH_BASE               CLB6_DATAEXCH_BASE_FRAME(0U)
#endif
#ifndef PMBUSA_BASE
    #define PMBUSA_BASE                      PMBUSA_BASE_FRAME(0U)
#endif
#ifndef I2CA_BASE
    #define I2CA_BASE                        I2CA_BASE_FRAME(0U)
#endif
#ifndef I2CB_BASE
    #define I2CB_BASE                        I2CB_BASE_FRAME(0U)
#endif
#ifndef SPIA_BASE
    #define SPIA_BASE                        SPIA_BASE_FRAME(0U)
#endif
#ifndef SPIB_BASE
    #define SPIB_BASE                        SPIB_BASE_FRAME(0U)
#endif
#ifndef SPIC_BASE
    #define SPIC_BASE                        SPIC_BASE_FRAME(0U)
#endif
#ifndef SPID_BASE
    #define SPID_BASE                        SPID_BASE_FRAME(0U)
#endif
#ifndef SPIE_BASE
    #define SPIE_BASE                        SPIE_BASE_FRAME(0U)
#endif
#ifndef FSITXA_BASE
    #define FSITXA_BASE                      FSITXA_BASE_FRAME(0U)
#endif
#ifndef FSITXB_BASE
    #define FSITXB_BASE                      FSITXB_BASE_FRAME(0U)
#endif
#ifndef FSITXC_BASE
    #define FSITXC_BASE                      FSITXC_BASE_FRAME(0U)
#endif
#ifndef FSITXD_BASE
    #define FSITXD_BASE                      FSITXD_BASE_FRAME(0U)
#endif
#ifndef FSIRXA_BASE
    #define FSIRXA_BASE                      FSIRXA_BASE_FRAME(0U)
#endif
#ifndef FSIRXB_BASE
    #define FSIRXB_BASE                      FSIRXB_BASE_FRAME(0U)
#endif
#ifndef FSIRXC_BASE
    #define FSIRXC_BASE                      FSIRXC_BASE_FRAME(0U)
#endif
#ifndef FSIRXD_BASE
    #define FSIRXD_BASE                      FSIRXD_BASE_FRAME(0U)
#endif
#ifndef EPG_BASE
    #define EPG_BASE                         EPG_BASE_FRAME(0U)
#endif
#ifndef EPGMUX_BASE
    #define EPGMUX_BASE                      EPGMUX_BASE_FRAME(0U)
#endif

#define BASE_ADDR_MASK   0xFF3FFFFFU

#endif
